Перем НаблюдениеРазрешено;

&НаСервере
Процедура ПротестироватьНаСервере()
	// здесь происходит простейшее изменение реквизитов объекта и проведение/запись объекта
	НоменклатураОб = Объект.Номенклатура.ПолучитьОбъект();
	СтруктураСостоянийОбъекта = RRT_NNET_M_НаблюдательИзменений.ПолучитьШаблонСтруктурыДляЗаписиВJSON();
	
	СтруктураСостоянийОбъекта1 = RRT_NNET_M_НаблюдательИзменений.ЗаполнитьСтруктуруСостоянийОбъекта(НоменклатураОб,
	СтруктураСостоянийОбъекта, "СостояниеДо");
	Если СтруктураСостоянийОбъекта = Неопределено Тогда
		Сообщить("Ошибка. При формировании состояния с режимом 'СостояниеДо' произошла непредвиденная ошибка.");
		Возврат;
	КонецЕсли; 
	// изменения
	НоменклатураОб.НаименованиеEN = Объект.НаименованиеНоменклатурыEN;
	
	Попытка
		
		СтруктураСостоянийОбъекта2 = RRT_NNET_M_НаблюдательИзменений.ЗаполнитьСтруктуруСостоянийОбъекта(НоменклатураОб,
		СтруктураСостоянийОбъекта1, "СостояниеПосле");
		Если СтруктураСостоянийОбъекта2 = Неопределено Тогда
			Сообщить("Ошибка. При формировании состояния с режимом 'СостояниеПосле' произошла непредвиденная ошибка.");
			Возврат;
		КонецЕсли; 
		
		НоменклатураОб.Записать();
		
		Попытка
		
			RRT_NNET_M_НаблюдательИзменений.НачатьЗаписьВJSON(СтруктураСостоянийОбъекта2);
		
		Исключение
		
		КонецПопытки; 
		 
	Исключение
		
		Сообщить(ОписаниеОшибки());
		Возврат;
		
	КонецПопытки; 
		
КонецПроцедуры

&НаКлиенте
Процедура Протестировать(Команда)
	ПротестироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	ЭтаОбработка = РеквизитФормыВЗначение("Объект");
	НаблюдениеРазрешено = RRT_NNET_M_НаблюдательИзменений.ПолучитьРазрешениеНаСборДанных(ЭтаОбработка);
	Если НаблюдениеРазрешено Тогда
		RRT_NNET_M_НаблюдательИзменений.ЗапуститьПроцессНаблюдения();
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

