Функция ПолучитьРазрешениеНаСборДанных(Значение) Экспорт

	НеобходимаяИнфо = Новый Структура;
	
	// определяем, является ли объект внешней обработкой 
	УказательВнешнейОбработки = СтрРазделить(Значение.Метаданные().ПолноеИмя(), ".");
	НеобходимаяИнфо.Вставить("ЭтоВнешняяОбработка", (ВРег(УказательВнешнейОбработки[0]) = "ВНЕШНЯЯОБРАБОТКА"));

	// получаем имя компьютера
	ТекНомерСеанса = НомерСеансаИнформационнойБазы();
	Сеансы = ПолучитьСеансыИнформационнойБазы();
	Для каждого Сеанс Из Сеансы Цикл
		Если Сеанс.НомерСеанса = ТекНомерСеанса Тогда
			НеобходимаяИнфо.Вставить("ИмяКомпьютера", Сеанс.ИмяКомпьютера);
			Прервать;
		КонецЕсли; 	
	КонецЦикла; 
	
	Если НеобходимаяИнфо.ЭтоВнешняяОбработка 
		И НеобходимаяИнфо.ИмяКомпьютера = "sws034" Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли; 
КонецФункции // ()

// Основная функция запуска наблюдения
Процедура ЗапуститьПроцессНаблюдения() Экспорт

	ЗапуститьWebСервер();
	СоздатьВременныйJSONФайл();

КонецПроцедуры
 

Процедура ЗапуститьWebСервер()

	WebСерверЗапущен = ПроверитьСостояниеWebСервера();
	
	Если WebСерверЗапущен Тогда
		Возврат;
	Иначе
		// открываем батник для запуска сервера
	КонецЕсли; 

КонецПроцедуры

Функция ПроверитьСостояниеWebСервера()

	// делаем запрос к web-серверу
	// запускаем батник для проверки работы web-сервера

КонецФункции // ()

Процедура СоздатьВременныйJSONФайл()

	// создаем JSON по предопределенному адресу (корень диска C)	

КонецПроцедуры

Процедура НачатьЗаписьВJSON(Режим = Неопределено) Экспорт

	Если Режим = Неопределено Тогда
	
		Сообщить("Ошибка. Неопределен режим записи данных в JSON.");
		Возврат;
	
	КонецЕсли; 	
	
	Если Режим = "ДоИзменений" Тогда
	
	// запись до	
	
	ИначеЕсли Режим = "ПослеИзменений" Тогда
		
	// запись после
	
	// также отсюда выход
		
	Иначе
		
		Сообщить("Ошибка. Неизвестный режим записи данных в JSON.");
		
	КонецЕсли;  

КонецПроцедуры
 
 
 
 
 