&НаСервере
Функция ВестиНаблюдение(ИмяКомпьютера, ЭтоВнешняяОбработка) Экспорт

	// логика такова: 
	// 1) (Начнем с моего компьютера) Если компьютер sws034, то запускаем эту процедуру
	// 2) Включаем сервер
	// 3) ПриЗаписи объекта (изменение реквизитов, добавление, удаление, (короче CRUD-операции),
	// записываем в JSON-файл информацию об объекте
	// 4) После проведения операции, записываем изменения в MongoDB 
	// (записываем имя компьютера, имя пользователя, ОБЯЗАТЕЛЬНО ДАТУ и сам объект и его реквизиты)
	Если НЕ ИмяКомпьютера = "sws034" ИЛИ НЕ ЭтоВнешняяОбработка Тогда
	
		Возврат Ложь;	
	
	КонецЕсли; 
	Возврат Истина;
КонецФункции

&НаСервере
Функция ПроверитьСостояниеСервера(Повторно = Ложь) Экспорт
	
	Инфо = ПолучитьШаблонСтруктуры();
	
	Если Повторно Тогда
		
		Попытка
			// запрос к серверу
			Инфо.ПодключениеУспешно = Истина;
			Инфо.Ошибка = Неопределено;
			Возврат Инфо;
		Исключение
			Инфо.ПодключениеУспешно = Ложь;
			Инфо.Ошибка = ОписаниеОшибки();
			Возврат Инфо;
		КонецПопытки; 
		
	Иначе
		
		// попытаться сделать запос к серверу
		// если неудача --> запуск сервера
		
		Попытка	
			Инфо.ПодключениеУспешно = Истина;
			Инфо.Ошибка = Неопределено;
			Возврат Инфо;
		Исключение
			ЗапуститьСервер();
		КонецПопытки;  
		
	КонецЕсли; 	
	
КонецФункции

&НаСервере
Процедура ЗапуститьСервер()

	
	
	//пауза
	ПроверитьСостояниеСервера(Истина);

КонецПроцедуры

&НаСервере
Функция ПолучитьШаблонСтруктуры()

	Инфо = Новый Структура;
	Инфо.Вставить("ПодключениеУспешно", Ложь);		
	Инфо.Вставить("Ошибка", "");

	Возврат Инфо;

КонецФункции // ()
 
 
 