&НаСервере
Процедура ВвестиНаблюдение() Экспорт

	// логика такова: 
	// 1) (Начнем с моего компьютера) Если компьютер sws034, то запускаем эту процедуру
	// 2) Включаем сервер
	// 3) ПриЗаписи объекта (изменение реквизитов, добавление, удаление, (короче CRUD-операции),
	// записываем в JSON-файл информацию об объекте
	// 4) После проведения операции, записываем изменения в MongoDB 
	// (записываем имя компьютера, имя пользователя, ОБЯЗАТЕЛЬНО ДАТУ и сам объект и его реквизиты)

КонецПроцедуры
 