Функция ПолучитьРазрешениеНаСборДанных(Значение) Экспорт

	НеобходимаяИнфо = Новый Структура;
	
	// определяем, является ли объект внешней обработкой 
	УказательВнешнейОбработки = СтрРазделить(Значение.Метаданные().ПолноеИмя(), ".");
	НеобходимаяИнфо.Вставить("ЭтоВнешняяОбработка", (ВРег(УказательВнешнейОбработки[0]) = "ВНЕШНЯЯОБРАБОТКА"));

	// получаем имя компьютера
	ТекНомерСеанса = НомерСеансаИнформационнойБазы();
	Сеансы = ПолучитьСеансыИнформационнойБазы();
	Для каждого Сеанс Из Сеансы Цикл
		Если Сеанс.НомерСеанса = ТекНомерСеанса Тогда
			НеобходимаяИнфо.Вставить("ИмяКомпьютера", Сеанс.ИмяКомпьютера);
			Прервать;
		КонецЕсли; 	
	КонецЦикла; 
	
	Если НеобходимаяИнфо.ЭтоВнешняяОбработка 
		И НеобходимаяИнфо.ИмяКомпьютера = "sws034" Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли; 
КонецФункции // ()

// Основная функция запуска наблюдения
Процедура ЗапуститьПроцессНаблюдения() Экспорт

	ЗапуститьWebСервер();
	СоздатьВременныйJSONФайл();

КонецПроцедуры
 

Процедура ЗапуститьWebСервер()

	WebСерверЗапущен = ПроверитьСостояниеWebСервера();
	
	Если WebСерверЗапущен Тогда
		Возврат;
	Иначе
		// открываем батник для запуска сервера
	КонецЕсли; 

КонецПроцедуры

Функция ПроверитьСостояниеWebСервера()

	// делаем запрос к web-серверу
	// запускаем батник для проверки работы web-сервера

КонецФункции // ()

Процедура СоздатьВременныйJSONФайл()

	// создаем JSON по предопределенному адресу (корень диска C)	

КонецПроцедуры

Процедура НачатьЗаписьВJSON(СтруктураСостоянийОбъекта) Экспорт

		

КонецПроцедуры

Функция ПолучитьШаблонСтруктурыДляЗаписиВJSON() Экспорт

	ШаблонСтруктуры = Новый Структура;
	ШаблонСтруктуры.Вставить("ОбъектДо", Новый Массив);
	ШаблонСтруктуры.Вставить("ОбъектПосле", Новый Массив);
	Возврат ШаблонСтруктуры;

КонецФункции // ()

Функция ЗаполнитьСтруктуруСостоянийОбъекта(ИзменяемыйОбъект, Режим = Неопределено, Ошибка = Ложь) Экспорт

	Если Ошибка Тогда
	
		Сообщить("Обработка остановлена. Возникла ошибка с объектом --> " + Строка(ИзменяемыйОбъект.Ссылка));	
		Возврат Неопределено;
		
	КонецЕсли; 
	
	Если Режим = Неопределено Тогда
	
		Сообщить("Ошибка. Режим записи состояния объекта неопределен.");	
		Возврат Неопределено;
		
	КонецЕсли; 
	
	Если Режим = "СостояниеДо" Тогда
	
		
	
	ИначеЕсли Режим = "СостояниеПосле" Тогда
		
	Иначе	
	
		Сообщить("Ошибка. Неизвестный режим записи состояния объекта.");
		Возврат Неопределено;
	
	КонецЕсли; 

КонецФункции // ()
 
 
 
 
 
 
 