Перем НаблюдениеРазрешено;

&НаСервере
Процедура ПротестироватьНаСервере()
	// здесь происходит простейшее изменение реквизитов объекта и проведение/запись объекта
	НоменклатураОб = Объект.Номенклатура.ПолучитьОбъект();
	// начинается запись в JSON объекта до изменения
	Если НаблюдениеРазрешено Тогда
	
		RRT_NNET_M_НаблюдательИзменений.НачатьЗаписьВJSON("ДоИзменений");			
	
	КонецЕсли; 
	
	// изменения
	НоменклатураОб.НаименованиеEN = Объект.НаименованиеНоменклатурыEN;
	
	Попытка
		
		НоменклатураОб.Записать();
		
		
	Исключение
		
		Сообщить(ОписаниеОшибки());
		Возврат;
		
	КонецПопытки; 
	
	Если НаблюдениеРазрешено Тогда
	
		RRT_NNET_M_НаблюдательИзменений.НачатьЗаписьВJSON("ПослеИзменений");			
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Протестировать(Команда)
	ПротестироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	ЭтаОбработка = РеквизитФормыВЗначение("Объект");
	НаблюдениеРазрешено = RRT_NNET_M_НаблюдательИзменений.ПолучитьРазрешениеНаСборДанных(ЭтаОбработка);
	Если НаблюдениеРазрешено Тогда
		RRT_NNET_M_НаблюдательИзменений.ЗапуститьПроцессНаблюдения();
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

